Repository: NMarjou/localization-app
Catalog: TMs/en-US_it-IT.tmx
Source language: en_us
Languages: it_it

source: You don’t have the necessary permissions to manage goal plans.
it_it: Non hai le autorizzazioni necessarie per gestire i piani degli obiettivi.

source: Please contact your system administrator for assistance.
it_it: Contattare l'amministratore di sistema per ricevere assistenza.

source: Select goal plan
it_it: Seleziona piano dell'obiettivo

source: Select goal type
it_it: Seleziona il tipo di obiettivo

source: Go to the career plan questionnaire step to make changes.
it_it: Vai al passaggio del questionario del piano di sviluppo professionale per apportare modifiche.

source: All skills from the library
it_it: Tutte le abilità dalla libreria

source: Define the source for skills and competency scales.
it_it: Definisci la fonte per le scale di competenze e le abilità.

source: Select skills & competency groups
it_it: Seleziona gruppi di competenze e abilità

source: Choose one option
it_it: Scegli un'opzione

source: Selected skills & competency groups
it_it: Gruppi di competenze e abilità selezionati

source: Select competency scale
it_it: Seleziona scala delle competenze

source: Preview check-ins in the career development page.
it_it: Anteprima dei check-in nella pagina dello sviluppo professionale.

source: You must enable at least one widget to move to the next step.
it_it: Devi abilitare almeno un widget per andare al passaggio successivo.

source: Career plans
it_it: Piani di carriera

source: Participants
it_it: Partecipanti

source: Reflect on your achievements, challenges, and career aspirations. Taking a moment to think about your experiences will help you clearly articulate your development goals.
it_it: Rifletta sui Suoi risultati, sulle sfide affrontate e sulle Sue aspirazioni di carriera. Prendersi un momento per pensare alle proprie esperienze La aiuterà a esprimere chiaramente i Suoi obiettivi di sviluppo.

source: Identify both your short- and long-term career goals. Be specific about what you want to accomplish and the skills you’d like to develop. This will ensure the plan aligns with your personal and professional growth.
it_it: Identifichi sia i Suoi obiettivi di carriera a breve che a lungo termine. Sia specifico su ciò che desidera raggiungere e sulle competenze che vorrebbe sviluppare. Questo garantirà che il piano sia in linea con la Sua crescita personale e professionale.

source: Think about the training, projects, or responsibilities that can help you achieve your goals. In your plan, include opportunities that will support your growth and career advancement.
it_it: Pensi alla formazione, ai progetti o alle responsabilità che possono aiutarLa a raggiungere i Suoi obiettivi. Nel Suo piano, includa opportunità che sosterranno la Sua crescita e lo sviluppo della Sua carriera.

source: Break your goals down into actionable steps. Be sure to outline a timeline for achieving them and track your progress along the way.
it_it: Scomponga i Suoi obiettivi in passaggi concreti. Si assicuri di definire una tempistica per raggiungerli e monitori i Suoi progressi lungo il percorso.

source: Create a supportive environment where workers feel comfortable sharing their aspirations, challenges, and goals. Listen actively and ask thoughtful questions to better understand their vision.
it_it: Crea un ambiente di supporto in cui i collaboratori si sentano a proprio agio nel condividere le proprie aspirazioni, sfide e obiettivi. Ascolta attivamente e poni domande ponderate per comprendere meglio la loro visione.

source: Take time to review the worker's career development plan in detail. Provide constructive feedback, acknowledge their strengths, and highlight areas for growth.
it_it: Prenda tempo per esaminare in dettaglio il piano di sviluppo professionale del Collaboratori. Fornisca un feedback costruttivo, riconosca i suoi punti di forza e evidenzi le aree di crescita.

source: Encourage your reports to explore new challenges and opportunities that help them grow while building on their current strengths and skills.
it_it: Incoraggi i Suoi collaboratori a esplorare nuove sfide e opportunità che li aiutino a crescere, valorizzando al contempo le loro attuali competenze e punti di forza.

source: Share your own experiences and insights to inspire and guide workers. Be their advocate and actively support their growth journey.
it_it: Condividi le tue esperienze e intuizioni per ispirare e guidare i collaboratori. Sii il loro sostenitore e supporta attivamente il loro percorso di crescita.

source: Prepare in advance
it_it: Preparare in anticipo

source: Define your goals
it_it: Definisca i Suoi obiettivi

source: Explore development opportunities
it_it: Esplorare opportunità di sviluppo

source: Set actionable steps
it_it: Impostare azioni concrete

source: Encourage open dialogue
it_it: Incoraggiare il dialogo aperto

source: Review the plan thoroughly
it_it: Esamini attentamente il piano

source: Suggest opportunities for growth
it_it: Suggerisca opportunità di crescita

source: Be a mentor, not just a manager
it_it: Sii un mentore, non solo un manager

source: Here are some tips to guide you through filling out your career development plan:
it_it: Ecco alcuni suggerimenti per guidarLa nella compilazione del Suo piano di sviluppo professionale:

source: Foster meaningful career development conversations!
it_it: Favorisca conversazioni significative sullo sviluppo della carriera!

source: Here are tips to effectively guide workers in their career development plans:
it_it: Ecco alcuni consigli per guidare efficacemente i Collaboratori nei loro piani di sviluppo professionale:

source: Career plans that your team members own.
it_it: Piani di carriera di proprietà dei Suoi collaboratori.

source: This worker currently has no career development plans
it_it: Questo Collaboratore non ha attualmente piani di sviluppo professionale

source: Are you sure you want to reassign this career development plan to the selected manager?
it_it: Vuoi davvero riassegnare questo piano di sviluppo della carriera al manager selezionato?

source: Confirm reassignment
it_it: Conferma riassegnazione

source: The career development plan was successfully reassigned.
it_it: Il piano di sviluppo della carriera è stato riassegnato con successo.

source: {{count}}/{{limit}} characters
it_it: {{count}}/{{limit}} caratteri

source: The text exceeds the character limit.
it_it: Il testo supera il limite di caratteri.

source: Once your manager submits their view on your performance, you will be invited to either accept and complete the check-in, or request to meet for further discussion.
it_it: Una volta che il tuo manager avrà inviato la sua opinione sulle tue prestazioni, riceverai un invito ad accettare e completare il check-in oppure a richiedere una riunione per ulteriori discussioni.

source: Set date
it_it: Imposta data

source: Add discussion point
it_it: Aggiungi punto di discussione

source: Add recurrence
it_it: Aggiungi ricorrenza

source: If yes, click the button and open the file once it has been downloaded to add this event to your calendar, and that of the other attendee.
it_it: Se sì, fai clic sul pulsante e apri il file dopo averlo scaricato per aggiungere questo evento al tuo calendario e a quello dell'altro partecipante.

source: Download invite
it_it: Scarica invito

source: Do you want to add this check-in to your calendar?
it_it: Vuoi aggiungere questo check-in al tuo calendario?

source: Make your check-ins more effective by adding key discussion points and agenda items every week. Reflect on the past week and plan for the next week to help increase productivity and ensure you and your manager are aligned on important deliverables.
it_it: Rendi i tuoi check-in più efficaci aggiungendo punti di discussione chiave e voci dell'agenda ogni settimana. Rifletti sulla settimana passata e pianifica per la settimana successiva per aumentare la produttività e assicurarti che tu e il tuo manager siate allineati sui deliverable importanti.

source: Have a great check-in conversation!
it_it: Buona conversazione di check-in.

source: Here are some tips to make the most of your check-ins.
it_it: Ecco alcuni consigli per sfruttare al meglio i tuoi check-in.

source: Make sure you use your check-in time wisely. Coming prepared can greatly benefit the quality of the conversation and also impress your manager, as it demonstrates your focus on your goals and development.
it_it: Assicurati di sfruttare al meglio il check-in. Arrivare preparati può migliorare notevolmente la qualità della conversazione, oltre a fare buona impressione sul tuo manager, poiché dimostra la tua attenzione agli obiettivi e allo sviluppo.

source: The central focus of a check-in should be your current workload, and it should aim at ensuring that you and your manager are aligned on your projects and goals.
it_it: L'area di interesse principale di un check-in dovrebbe essere il tuo carico di lavoro attuale per aiutare te e il tuo manager ad allinearvi sui vostri progetti e obiettivi.

source: To prepare for your check-in, take some notes about the main items you have been working on that week and any key points you want to discuss. It only takes five minutes, but it can significantly improve the quality of your conversation.
it_it: Per prepararti al tuo check-in, prendi qualche appunto sui principali elementi su cui hai lavorato durante la settimana e su eventuali punti chiave che desideri discutere. Ci vogliono solo cinque minuti, ma può migliorare significativamente la qualità della tua conversazione.

source: All participants
it_it: Tutti i partecipanti

source: Assign check-in
it_it: Assegna check-in

source: Recognize behavior profile of:
it_it: Riconosci il profilo comportamentale di:

source: Offer your team member insight into how you think they have progressed on their behaviors over this period.
it_it: Offri al membro del tuo team insight su come pensi che abbia fatto progressi nei suoi comportamenti durante questo periodo.

source: You have changed the type of the check-in. Please review the change with the check-in attendee.
it_it: Hai cambiato il tipo di check-in. Esamina la modifica con il partecipante al check-in.

source: No messages yet
it_it: Ancora nessun messaggio

source: Why not start a conversation now?
it_it: Perché non avviare una conversazione ora?

source: Check-in chat
it_it: Chat di check-in

source: The check-in <u>{{title}} with {{name}}</u> was completed.
it_it: Il check-in <u>{{title}} con {{name}}</u> è stato completato.

source: Your check-in was successfully created.
it_it: Check-in creato correttamente.

source: {{numberOfCheckins}} check-ins with {{AssignedToUserName}} will be created.
it_it: Verranno creati {{numberOfCheckins}} check-in con {{AssignedToUserName}}.

source: You can create another check-in at any time.
it_it: Puoi creare un altro check-in in qualsiasi momento.

source: {{count}} check-ins were successfully created.
it_it: {{count}} check-in creati correttamente.

source: The scheduled check-in <u>{{title}} with {{name}}</u> was canceled.
it_it: Il check-in <u>{{title}} pianificato con {{name}}</u> è stato annullato.

source: Your check-in was successfully saved.
it_it: Check-in salvato correttamente.

source: Focus factors for this check-in
it_it: Fattori di concentrazione per questo check-in

source: Your check-in was successfully updated.
it_it: Check-in aggiornato correttamente.

source: {{name}} will be notified that you have updated this check-in.
it_it: {{name}} riceverà una notifica del fatto che hai aggiornato questo check-in.

source: Add point
it_it: Aggiungi punto

source: No discussion points for the moment
it_it: Nessun punto di discussione per il momento

source: Checklist
it_it: Elenco di controllo

source: Are you sure you want to mark the check-in <strong>{{name}}</strong> as complete?
it_it: Contrassegnare il check-in <strong>{{name}}</strong> come completato?

source: Complete check-in
it_it: Completa check-in

source: Select a date
it_it: Seleziona una data

source: Are you sure you want to remove the check-in <strong>{{name}}</strong> from your check-in list?
it_it: Rimuovere il check-in <strong>{{name}}</strong> dal tuo elenco dei check-in?

source: Delete check-in
it_it: Elimina check-in

source: Description and discussion points
it_it: Descrizione e punti di discussione

source: Check-ins created
it_it: Check-in creati

source: To help you prepare, include an overview of what you'd like to talk about here.
it_it: Per aiutarti a prepararti, includi una panoramica di ciò di cui vorresti parlare qui.

source: Add comment
it_it: Aggiungi commento

source: Discussion points
it_it: Punti di discussione

source: Create some pointers to kick-start your check-in conversation.
it_it: Crea alcuni spunti per avviare la tua conversazione di check-in.

source: Edit check-in
it_it: Modifica check-in

source: Edit discussion point
it_it: Modifica punto di discussione

source: Back to upcoming
it_it: Torna a Imminenti

source: No check-ins have occurred that day.
it_it: Quel giorno non sono stati effettuati check-in.

source: No upcoming check-ins to be displayed. <br/>Schedule a new check-in.
it_it: Nessun check-in imminente da visualizzare. <br/>Pianifica un nuovo check-in.

source: No check-ins were recently updated.
it_it: Nessun check-in aggiornato di recente.

source: No check-ins have taken place in the past.
it_it: In passato non sono stati effettuati check-in.

source: Each worker to whom this check-in has been assigned can edit this section in their form.
it_it: Ogni collaboratore a cui è stato assegnato questo check-in può modificare questa sezione nel proprio modulo.

source: Here are some helpful tips for understanding the different types of check-ins.
it_it: Ecco alcuni consigli utili per comprendere i diversi tipi di check-in.

source: About check-ins
it_it: Informazioni sui check-in

source: Occurs every two weeks on {{day}} effective {{startOn}} until {{endOn}}. In total, {{count}} number of check-ins will be created.
it_it: {{day}}, ogni due settimane, a partire dalla data {{startOn}} fino alla data {{endOn}}. In totale, verranno creati {{count}} check-in.

source: Goal due date
it_it: Data di scadenza dell'obiettivo

source: Showing goals and deliverables of:
it_it: Obiettivi e risultati di:

source: Goal priority
it_it: Priorità degli obiettivi

source: Goal progress
it_it: Avanzamento degli obiettivi

source: Goal tracking status
it_it: Stato di monitoraggio degli obiettivi

source: Goal type: “{{typeName}}“
it_it: Tipo di obiettivo: "{{typeName}}"

source: Still in progress.
it_it: Ancora in corso.

source: How was your check-in?
it_it: Com'è andato il tuo check-in?

source: Are you sure you want to mark the check-in <strong>{{checkInTitle}}</strong> as completed?
it_it: Contrassegnare il check-in <strong>{{checkInTitle}}</strong> come completato?

source: Marked as done by {{nickName}} {{name}}.
it_it: Contrassegnato come completato da {{nickName}} {{name}}.

source: Assigned to
it_it: Assegnato a

source: {{count}} workers
it_it: {{count}} collaboratori

source: {{count}} worker
it_it: {{count}} collaboratore

source: {{count}} users
it_it: {{count}} utenti

source: Number of check-ins assigned to each selected worker and their line manager.
it_it: Numero di check-in assegnati a ciascun collaboratore selezionato e al proprio manager diretto.

source: Assigned to: {{count}}
it_it: Assegnato a: {{count}}

source: This assignment will create {{count}} check-ins between each worker and their line manager. Once the check-in is assigned, users will be able to edit its details and add a date.
it_it: Questa assegnazione creerà {{count}} check-in tra ciascun collaboratore e il proprio manager diretto. Una volta assegnato il check-in, gli utenti potranno modificarne i dettagli e aggiungere una data.

source: Get started by assigning one.
it_it: Inizi a assegnarne uno.

source: No check-ins mass assignments yet!
it_it: Nessuna assegnazione di check-in di massa al momento!

source: Excluded individuals
it_it: Individui esclusi

source: Excluded workers: {{count}}
it_it: Collaboratori esclusi: {{count}}

source: Excluded
it_it: Escluso

source: Included
it_it: Incluso

source: No results match the search criteria. Clear the search to show all results.
it_it: Nessun risultato corrispondente ai criteri di ricerca. Cancella la ricerca per mostrare tutti i risultati.

source: Search for workers
it_it: Cerca collaboratori

source: Performance check-ins require managers to provide their views on their team members' progress and performance.
it_it: I check-in delle prestazioni richiedono ai manager di fornire le loro opinioni sui progressi e sulle prestazioni dei membri del loro team.

source: Regular check-ins enable managers and their team members to discuss day-to-day progress and any developmental focus.
it_it: Check-in regolari consentono ai manager e ai membri dei loro team di discutere dei progressi quotidiani e di qualsiasi area di interesse dello sviluppo.

source: See all participants
it_it: Vedi tutti i partecipanti

source: Monthly check-in
it_it: Check-in mensile

source: Search for a worker or an organization
it_it: Cerca un collaboratore o un'organizzazione

source: Occurs on day {{day}} of every month, effective {{startOn}} through {{endOn}}. In total, {{count}} check-ins will be created.
it_it: {{day}} ogni mese, a partire dalla data {{startOn}} fino alla data {{endOn}}. In totale, verranno creati {{count}} check-in.

source: Specific date
it_it: Data specifica

source: Past
it_it: Passato

source: Upcoming
it_it: Previsti

source: Today
it_it: Oggi

source: Assign check-ins
it_it: Assegna check-in

source: If you're assigning to multiple users, it might take a while for this list to appear in the check-in view.
it_it: Se stai assegnando a più utenti, potrebbe volerci del tempo prima che questo elenco appaia nella visualizzazione check-in.

source: The check-in was successfully assigned.
it_it: Check-in assegnato correttamente.

source: This assignment will create {{count}} check-ins in total, between each selected worker and their line manager.
it_it: Questa assegnazione creerà in totale {{count}} check-in, tra ciascun collaboratore selezionato e il suo manager diretto.

source: Are you sure you want to assign this check-in?
it_it: Assegnare questo check-in?

source: No description added
it_it: Nessuna descrizione aggiunta

source: No discussion points added
it_it: Nessun punto di discussione aggiunto

source: Overall performance
it_it: Prestazioni complessive

source: My overall performance
it_it: Le mie prestazioni complessive

source: Offer your team member insight into how you think they have progressed on their overall performance over this period.
it_it: Offri al membro del tuo team insight su come pensi che abbia fatto progressi nelle sue prestazioni complessive in questo periodo.

source: Check-in with
it_it: Check-in con

source: Pending manager submission
it_it: In attesa di invio da parte del manager

source: Allow managers to schedule dedicated conversations with direct reports to address performance-related topics.
it_it: Consenti ai manager di pianificare conversazioni dedicate con i subordinati diretti per affrontare argomenti relativi alle prestazioni.

source: Offer your team member insights into how you think they have progressed on their behaviors this period.
it_it: Offri al membro del tuo team insight su come pensi che abbia fatto progressi nei suoi comportamenti durante questo periodo.

source: Your comment
it_it: Il tuo commento

source: Please share your thoughts in this section.
it_it: Condividi i tuoi pensieri in questa sezione.

source: Gain insight into how your manager thinks you are progressing on your behaviors over this period.
it_it: Ottieni insight su come il tuo manager ritiene che tu stia facendo progressi nei tuoi comportamenti durante questo periodo.

source: Gain insight into how your manager thinks you are progressing on your goals over this period.
it_it: Ottieni insight su come il tuo manager ritiene che tu stia facendo progressi nei tuoi obiettivi durante questo periodo.

source: Gain insight into how your manager thinks you are progressing on your overall performance over this period.
it_it: Ottieni insight su come il tuo manager ritiene che tu stia facendo progressi nelle tue prestazioni complessive durante questo periodo.

source: Offer your team member insights into how you think they have progressed on their goals over this period.
it_it: Offri al membro del tuo team insight su come pensi che abbia fatto progressi nei suoi obiettivi in questo periodo.

source: This gives you insights into how your manager thinks you are progressing on your behaviors over this period.
it_it: Ti offre insight su come il tuo manager ritiene che tu abbia fatto progressi nei tuoi comportamenti durante questo periodo.

source: Offer your team member insights into how you think they have progressed on their overall performance over this period.
it_it: Offri al membro del tuo team insight su come pensi che abbia fatto progressi nelle sue prestazioni complessive in questo periodo.

source: Select rating
it_it: Seleziona valutazione

source: This user is inactive or your reporting relationship with them has changed. You can't create or update check-ins with them.
it_it: Questo utente è inattivo o il vostro rapporto è cambiato. Non puoi creare o aggiornare check-in con questo utente.

source: The end date must be later than the start date.
it_it: La data di fine deve essere successiva alla data di inizio.

source: Bi-weekly
it_it: Bisettimanale

source: Monthly
it_it: Mensile

source: Weekly
it_it: Settimanale

source: Repeat
it_it: Ripeti

source: Recurrence details
it_it: Dettagli della ricorrenza

source: Facilitate discussions between managers and team members about daily progress and areas for development.
it_it: Facilita le discussioni tra manager e membri del team sui progressi quotidiani e sulle aree di sviluppo.

source: Action required
it_it: Azione richiesta

source: Action required — {{count}} item(s)
it_it: Azione richiesta, {{count}} elemento/i

source: To finish adding this check-in to your calendar, open the file once it has downloaded. If you need to change the date or time, you can do so directly from your calendar.
it_it: Per completare l'aggiunta di questo check-in al tuo calendario, apri il file dopo averlo scaricato. Se hai bisogno di cambiare la data o l'ora, puoi farlo direttamente dal tuo calendario.

source: There are unsaved changes in the form. To submit this check-in, you must save all comments and/or ratings.
it_it: Sono presenti modifiche non salvate nel modulo. Per inviare questo check-in, è necessario salvare tutti i commenti e/o le valutazioni.

source: Save to proceed
it_it: Salva per procedere

source: Schedule check-in
it_it: Pianifica check-in

source: Done
it_it: Fatto

source: Pending confirmation
it_it: In attesa di conferma

source: Under review
it_it: In fase di revisione

source: Are you sure you want to complete this check-in? Remember, you can create another check-in at anytime.
it_it: Completare questo check-in? Ricorda, puoi creare un altro check-in in qualsiasi momento.

source: Open check-in
it_it: Apri check-in

source: Additional information
it_it: Informazioni aggiuntive

source: My list
it_it: Il mio elenco

source: Open {{name}} primary action
it_it: Apri azione principale {{name}}

source: Participant
it_it: Partecipante

source: comments
it_it: commenti

source: Subject
it_it: Oggetto

source: Creator:
it_it: Creatore:

source: Assigned
it_it: Assegnato

source: {{count}} comments
it_it: {{count}} commenti

source: 1 comment
it_it: 1 commento

source: Last month
it_it: Mese scorso

source: Last week
it_it: Settimana scorsa

source: Jump to a specific date
it_it: Salta a una data specifica
